src/DataProcessors/кфкПанельАдминистрирования/кфкПанельАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кфкПанельАдминистрирования</name>
</mdclass:DataProcessor>

src/InformationRegisters/кфкПараметрыЛогирования/кфкПараметрыЛогирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыЛогирования</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЗаголовкиСообщенияВходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьЗаголовкиСообщенияИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьИсходныеДанныеИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьТелоСообщенияВходящие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьТелоСообщенияИсходящих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/DataProcessors/кфкПанельАдминистрирования/Forms/Логирование/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	кфкКаталогЛогированияКомпоненты.Значение КАК КаталогЛогирования,
		|	кфкФорматИмениФайловЛогированияКомпоненты.Значение КАК ФорматИмениФайловЛогирования
		|ИЗ
		|	Константа.кфкКаталогЛогированияКомпоненты КАК кфкКаталогЛогированияКомпоненты,
		|	Константа.кфкФорматИмениФайловЛогированияКомпоненты КАК кфкФорматИмениФайловЛогированияКомпоненты";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ПрочитатьПараметрыЛогирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогЛогированияКомпонентыПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	УстановитьКаталогЛогирования(КаталогЛогирования);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогЛогированияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	ФайловаяСистемаКлиент.ВыбратьКаталог(
		Новый ОписаниеОповещения("ЗавершитьВыборКаталогаЛогирования", ЭтотОбъект),
		НСтр("ru = 'Каталог логирования событий'"),
		КаталогЛогирования);
		
КонецПроцедуры

&НаКлиенте
Процедура КаталогЛогированияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФайловаяСистемаКлиент.ОткрытьПроводник(КаталогЛогирования);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогЛогированияОчистка(Элемент, СтандартнаяОбработка)
	УстановитьКаталогЛогирования(КаталогЛогирования);
КонецПроцедуры

&НаКлиенте
Процедура ФорматИмениФайловЛогированияПриИзменении(Элемент)
	УстановитьФорматИмениФайловЛогирования(ФорматИмениФайловЛогирования);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияАдресСервисаПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияПрефиксПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияВыгружатьЗаголовкиСообщенияИсходящихПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияВыгружатьТелоСообщенияИсходящихПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияВыгружатьИсходныеДанныеИсходящихПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияВыгружатьЗаголовкиСообщенияВходящихПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЛогированияВыгружатьТелоСообщенияВходящиеПриИзменении(Элемент)
	ОбновитьПараметрыЛогирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Навигация

&НаКлиенте
Процедура ПерейтиОсновное(Команда)
	ВладелецФормы.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиФоновыеЗадания(Команда)
	ОткрытьСтраницу("ФоновыеЗадания");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиРегламентноеЗадание(Команда)
	ОткрытьСтраницу("РегламентноеЗадание");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиОчереди(Команда)
	ОткрытьСтраницу("Очереди");
КонецПроцедуры

#КонецОбласти

#Область Логирование

&НаКлиенте
Процедура ИспользоватьВнешнееЛогирование(Команда)
	
	ПараметрыЛогирования.Использовать = Не ПараметрыЛогирования.Использовать;
	
	ОбновитьПараметрыЛогирования();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	// НАВИГАЦИЯ
	Элементы.ПерейтиФоновыеЗадания.Картинка = ВладелецФормы.Элементы.ПерейтиФоновыеЗадания.Картинка;
	Элементы.ПерейтиРегламентноеЗадание.Картинка = ВладелецФормы.Элементы.ПерейтиРегламентноеЗадание.Картинка;
	
	// ЛОГИРОВАНИЕ
	Элементы.ИспользоватьВнешнееЛогирование.Пометка = ПараметрыЛогирования.Использовать;
	Элементы.ГруппаПараметрыЛогирования.Доступность = ПараметрыЛогирования.Использовать;
	Элементы.ПараметрыЛогированияПрефикс.Доступность = Не ПустаяСтрока(ПараметрыЛогирования.АдресСервиса);
	Элементы.ГруппаПараметрыЛогированияНастройкиВыгрузки.Доступность = Не ПустаяСтрока(ПараметрыЛогирования.АдресСервиса);
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ОткрытьСтраницу(ИмяСтраницы)
	
	ОткрытьФорму("Обработка.кфкПанельАдминистрирования.Форма." + ИмяСтраницы, , ВладелецФормы, , ВладелецФормы.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область Логирование

// Завершить выбор каталога логирования.
// 
// Параметры:
//  ПутьККаталогу - Строка, Массив Из Строка - Путь к каталогу
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ЗавершитьВыборКаталогаЛогирования(ПутьККаталогу, ДополнительныеПараметры) Экспорт
	
	Если ПутьККаталогу = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПутьККаталогу) = Тип("Массив") И ПутьККаталогу.Количество() Тогда
		КаталогЛогирования = ПутьККаталогу[0];
		
	ИначеЕсли ТипЗнч(ПутьККаталогу) = Тип("Строка") И Не ПустаяСтрока(ПутьККаталогу) Тогда
		КаталогЛогирования = ПутьККаталогу;
		
	КонецЕсли;
	
	Если СодержитКириллицуВСтроке(КаталогЛогирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Каталог логирования не может содержать кириллицу!'"), ,
			, "КаталогЛогирования");
		
	Иначе
		УстановитьКаталогЛогирования(КаталогЛогирования);
		
	КонецЕсли;
	
КонецПроцедуры

// Содержит кириллицу в строке.
// 
// Параметры:
//  СтрокаПроверки - Строка - Строка проверки
// 
// Возвращаемое значение:
//  Булево - Содержит кириллицу в строке
&НаКлиенте
Функция СодержитКириллицуВСтроке(СтрокаПроверки)
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Или ПустаяСтрока(СтрокаПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Индекс = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, Индекс, 1));
		Если 1040 <= КодСимвола И КодСимвола <= 1105 Или КодСимвола = 1025 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПараметрыЛогирования()
	
	ПараметрыЛога = Новый Структура;
	ПараметрыЛога.Вставить("Использовать", Ложь);
	// Настройки внешнего логирования
	ПараметрыЛога.Вставить("АдресСервиса", "");
	ПараметрыЛога.Вставить("Префикс", "");
	// ИсходящиеСообщения
	ПараметрыЛога.Вставить("ВыгружатьИсходныеДанныеИсходящих", Ложь);
	ПараметрыЛога.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Ложь);
	ПараметрыЛога.Вставить("ВыгружатьТелоСообщенияИсходящих", Ложь);
	// ВходящиеСообщения
	ПараметрыЛога.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Ложь);
	ПараметрыЛога.Вставить("ВыгружатьТелоСообщенияВходящие", Ложь);
	
	ЗаполнитьЗначенияСвойств(ПараметрыЛога, ПараметрыЛогирования);
	
	ОбновитьПараметрыЛогированияНаСервере(ПараметрыЛога);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКаталогЛогирования(Значение)
	
	Константы.кфкКаталогЛогированияКомпоненты.Установить(Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьФорматИмениФайловЛогирования(Значение)
	
	Константы.кфкФорматИмениФайловЛогированияКомпоненты.Установить(Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьПараметрыЛогированияНаСервере(НовыеПараметры)
	
	ПараметрыЛога = РегистрыСведений.кфкПараметрыЛогирования.ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ПараметрыЛога, НовыеПараметры);
	РегистрыСведений.кфкПараметрыЛогирования.ОбновитьПараметры(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыЛогирования()
	
	ПараметрыЛога = РегистрыСведений.кфкПараметрыЛогирования.ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ПараметрыЛогирования, ПараметрыЛога);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
